Repository: Minesto23/smartHR
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Update:
es: Ultima Actualización:

source: Recent News
es: Noticias Recientes

source: MORE
es: MÁS

source: Posts containing
es: Posts que contienen

source: Contact
es: Contacto

source: Smart HR Services’ Team is focused on helping you succeed by taking care of the things that may be distracting you from the bigger picture “Your Business”.
es: El equipo de Smart HR Services se enfoca en ayudarlo a tener éxito al ocuparse de las cosas que pueden estar distrayéndolo del panorama general “Su negocio”

source: Send
es: Enviar

source: If you got any questions <br>please do not hesitate to send us a message
es: Si tiene alguna pregunta, no dude en enviarnos un mensaje

source: Your message was sent, We'll in contact with you
es: Su mensaje ha sido enviado, estaremos en contacto con usted

source: Your message was not send, Please enter your data again
es: Su mensaje no ha sido enviado, por favor ingrese sus datos de nuevo

source: Your quote was saved, We'll in contact with you
es: Su cita ha sido guardada, estaremos en contacto con usted

source: Your quote was not saved, Please enter data again
es: Su cita no ha sido guardada, por favor ingrese sus datos de nuevo

source: Your quote was not saved, The turn was not disponible please choose another
es: Su cita no ha sido guardada, el turno seleccionado no se encuentra disponible

source: Book your 30 minutes free phone consultation
es: Reserve su consulta telefónica gratuita de 30 minutos

source: Here
es: Aquí

source: Select Your Turn
es: Seleccione su Turno

source: Home
es: Inicio

source: Who we are
es: Quiénes Somos

source: Consulting Services
es: Servicios de Consulta

source: F.A.Q
es: Preguntas Frecuentes

source: About us
es: Acerca de Nosotros

source: What makes us different from other HR companies? Smart HR of South Florida provides a full bilingual human resources solutions for small business. We roll up our sleeves and become your small business HR department, or we advise you on the best solutions for your business – based exclusively on what your company needs. Our solutions are always tailored to fit your company’s requirements from just a small task or audit to a full HR Solution.
es: ¿Qué nos hace diferentes de otras empresas de recursos humanos? Smart HR of South Florida ofrece soluciones completas bilingües de recursos humanos para pequeñas empresas. Nos arremangamos y nos convertimos en el departamento de recursos humanos de su pequeña empresa, o le asesoramos sobre las mejores soluciones para su negocio, basadas exclusivamente en lo que su empresa necesita. Nuestras soluciones siempre se adaptan a los requisitos de su empresa, desde una pequeña tarea o auditoría hasta una solución completa de recursos humanos.

source: What HR ins't vs What HR is
es: Qué no es HR versus Qué es HR

source: If you want to know more about what Smarth HR offers, check our services​​.
es: Si desea saber más sobre lo que ofrece Smarth HR, consulte nuestros servicios.

source: CHECK
es: REVISAR

source: Frequently Asked Questions
es: Preguntas Frecuentes

source: What can a Human Resources
es: ¿Qué puede hacer un

source: Consultant do for me?
es: consultor de recursos humanos por mí?

source: Outsourcing has become increasingly important as Human Resources professionals or small business owners seek ways to reduce time and resources spent on administration, so they can concentrate on more strategic activities. This reduction in time and resources also translates to savings for the business.
es: La subcontratación se ha vuelto cada vez más importante a medida que los profesionales de Recursos Humanos o los propietarios de pequeñas empresas buscan formas de reducir el tiempo y los recursos dedicados a la administración, para que puedan concentrarse en actividades más estratégicas. Esta reducción en tiempo y recursos también se traduce en ahorros para el negocio.

source: But not all consulting services are the same- Smart HR Services will provide a Personalized and In Person presence to your business, making your employee’s feel that they do have onsite Human Resources support they can reach out to with questions and concerns!
es: Pero no todos los servicios de consultoría son iguales: Smart HR Services proporcionará una presencia personalizada y en persona a su negocio, ¡haciendo que sus empleados sientan que sí tienen soporte de Recursos Humanos en el lugar al que pueden comunicarse con preguntas y preocupaciones!

source: Besides giving in-house HR professionals or office personnel more opportunity to focus on strategy, outsourcing can:
es: Además de brindar a los profesionales de recursos humanos internos o al personal de oficina más oportunidades para concentrarse en la estrategia, la subcontratación puede:

source: • Provide companies access to specialized HR expertise.
es: • Proporcionar a las empresas acceso a experiencia especializada en recursos humanos.

source: • Help with regulatory compliance.
es: • Ayuda con el cumplimiento normativo.

source: • Speed up response times on transactional HR functions such as benefits enrollment and payroll.
es: • Acelerar los tiempos de respuesta en las funciones de recursos humanos transaccionales, como la inscripción de beneficios y la nómina.

source: • Develop your company policies and processes among others…
es: • Desarrolle las políticas y procesos de su empresa, entre otros ...

source: When to go In-House and when
es: Cuando hacerlo uno mismo y cuando

source: to outsource HR?
es: buscar un espcialista en Recursos Humanos

source: Have you considered outsourcing HR? If your business is new, perhaps not.
es: ¿Has considerado la externalización de recursos humanos? Si su negocio es nuevo, tal vez no.

source: When you first start your business, your priority is to hire people who are integral to building the product and growing the company.
es: Cuando inicia su negocio por primera vez, su prioridad es contratar personas que sean parte integral de la construcción del producto y el crecimiento de la empresa.

source: At some point though, a business grows big enough that it needs people to take care of the back office operations of the company. You need someone responsible for coordinating interviews, sending offer letters, managing benefits administration, and much, much more.
es: Sin embargo, cuando en algún momento, un negocio crece lo suficientemente grande como para que necesite personas que se encarguen de las operaciones administrativas de la empresa. Necesita a alguien responsable de coordinar entrevistas, enviar cartas de oferta, administrar la administración de beneficios y mucho, mucho más.

source: The problem with that job is that it’s incredibly multifaceted, and it can be hard to find all those skills in one person.
es: El problema con ese trabajo es que es increíblemente multifacético y puede ser difícil encontrar todas esas habilidades en una sola persona.

source: Outsourcing HR? Understanding
es: ¿Outsourcing de recursos humanos?

source: the Costs and Benefits
es: Comprenda los costos y beneficios

source: The question today is, do you need an internal HR staff? When is staffing up an HR department important, and when should you consider HR outsourcing?
es: La pregunta de hoy es, ¿necesita un personal interno de recursos humanos? ¿Cuándo es importante la dotación de personal de un departamento de recursos humanos y cuándo debería considerar la contratación externa de recursos humanos?

source: The reality is, a well-functioning HR department (often in consultation with counsel) can ensure that you are compliant, have payroll figured out, onboard everyone appropriately, and hire the correct people, while also ensuring that the current employees are comfortable, and that the culture continues to improve.
es: La realidad es que un departamento de recursos humanos que funciona bien (a menudo en consulta con un abogado) puede garantizar que usted cumpla con los requisitos, que se haya resuelto la nómina, que se incorpore a todos adecuadamente y que contrate a las personas correctas, al tiempo que se asegura de que los empleados actuales estén cómodos y que la cultura continúa mejorando.

source: How Smart HR Services can
es: ¿Cómo Smart HR Services puede

source: save me money?
es: ahórrarme dinero?

source: Whether you're in need of a short, mid, or long-term solution, we provide customized and flexible HR solutions to suit your Human Resources needs. We work on or off-site, either as a standalone HR services consultant or in conjunction with your existing human resources team.
es: Ya sea que necesite una solución a corto, mediano o largo plazo, ofrecemos soluciones de recursos humanos personalizadas y flexibles para satisfacer sus necesidades de Recursos Humanos. Trabajamos dentro o fuera del sitio, ya sea como consultor independiente de servicios de recursos humanos o en conjunto con su equipo de recursos humanos existente.

source: Current economic trends are now forcing businesses to consider process outsourcing of administrative functions to improve basic services and maintain compliance with the ever changing regulations.
es: Las tendencias económicas actuales están obligando a las empresas a considerar la externalización de procesos de las funciones administrativas para mejorar los servicios básicos y mantener el cumplimiento de las normativas en constante cambio.

source: Outsourcing daily HR functions, recruitment processes, employee benefit administration and payroll allows key employees to focus on strategic initiatives that benefit the organization, increase productivity and thereby profitability.
es: La externalización de las funciones diarias de recursos humanos, los procesosde reclutamiento, la administración de beneficios de los empleados y la nóminapermite a los empleados clave centrarse en iniciativas estratégicas que benefician a la organización, aumentar la productividad y, por lo tanto, la rentabilidad.

source: A full time HR manager in South Florida can conservatively cost the company $70,000 a year; having Smart HR Services as your trusted Human Resources partner can save your company up to 70%% of that annual cost; while you will still have 14 years of expertise available to your business and your employees will still get that in person assistance they will require.
es: Un gerente de recursos humanos a tiempo completo en el sur de Florida puede costarle a la compañía $ 70,000 al año de manera conservadora; tener Smart HR Services como su socio confiable de Recursos Humanos puede ahorrarle a su empresa hasta el 70% de ese costo anual; mientras que todavía tendrá 14 años de experiencia disponibles para su negocio y sus empleados seguirán recibiendo la asistencia en persona que necesitarán.

source: Which HR Functions Can be
es: ¿Qué funciones de recursos humanos se pueden

source: Outsourced?
es: subcontratar?

source: HR covers a lot of ground, so it’s not always apparent which functions can be outsourced effectively. A good first step is defining what role you want HR to play in your company; a free 30 minutes consultation with one of our consultants can help you create a better picture!
es: El área de recursos humanos cubre mucho terreno, por lo que no siempre es evidente qué funciones se pueden externalizar de manera efectiva. Un buen primer paso es definir qué papel desea que desempeñe Recursos Humanos en su empresa; ¡Una consulta gratuita de 30 minutos con uno de nuestros consultores puede ayudarlo a crear una mejor imagen!

source: In general, HR provides the most value on strategic initiatives that have to do with building strong work teams, like recruiting, hiring, and developing company culture. While they are often responsible for other key tasks like payroll and managing benefits, creating policies and drafting job descriptions.
es: En general, Smart HR Brinda el mayor valor a las iniciativas estratégicas que tienen que ver con la creación de equipos de trabajo sólidos, como el reclutamiento, la contratación y el desarrollo de la cultura empresarial. Si bien a menudo son responsables de otras tareas clave como la nómina y la gestión de beneficios, la creación de políticas y la redacción de descripciones de trabajo.

source: Here are a few common functions that HR outsourcing can be good for:
es: Aquí hay algunas funciones comunes para las que la externalización de recursos humanos puede ser buena:

source: • Payroll services
es: • Servicios de nómina

source: • Benefits administration, such as health coverage and 401(k)
es: • Administración de beneficios, como cobertura de salud y 401 (k)

source: • Employee Assistance Program (EAP) and counseling
es: • Programa de asistencia al empleado (EAP) y asesoramiento

source: • Training
es: • Entrenamiento

source: • Employment-related compliance
es: • Ayuda con el cumplimiento normativo.

source: • Background screenings
es: • Proyecciones de fondo

source: • On-boarding and Terminations
es: • Incorporación y terminaciones compatibles

source: • Recruiting
es: • Reclutamiento

source: • Employee/Culture assessment
es: • Evaluación de empleo y cultura

source: • Annual planning and budgeting
es: • Planificación y presupuesto anual.

source: It’s so easy to take an all-or-nothing approach to the outsourcing of HR. But since each business is unique, one way to simplify the conversation around outsourcing HR or keeping it in-house is to consider the growth stage of your business.
es: Es muy fácil adoptar un enfoque de todo o nada para la externalización de recursos humanos. Pero dado que cada negocio es único, una forma de simplificar la conversación sobre la contratación externa de recursos humanos o mantenerlo en la empresa es considerar la etapa de crecimiento de su negocio.

source: 0-10 Employees
es: 0-10 Empleados

source: If you’re running a new business; it can be easy to believe you can do it yourself. There are only a few of you, so what’s the worst that can happen?
es: Si está ejecutando un nuevo negocio; Puede ser fácil creer que puede hacerlo usted mismo. Solo hay unos pocos de ustedes, entonces, ¿qué es lo peor que puede pasar?

source: Between managing benefits, payroll, time off, writing employee policies, hiring, firing, on-boarding, and everything else that’s going on, when will you have time to talk to investors, build the product, or make significant business developments?
es: Entre la gestión de beneficios, la nómina, el tiempo libre, la redacción de políticas de empleados, la contratación, el despido, la incorporación y todo lo demás que está sucediendo, ¿cuándo tendrá tiempo para hablar con los inversores, desarrollar el producto o realizar desarrollos comerciales significativos?

source: At this stage, it often makes sense to outsource many HR functions. There are many companies and software platforms available to help you manage the majority of the tasks mentioned above. But very few will give you the personalized service and the in person presence that Smart HR services offers; Besides, your focus should be on growing and managing your team, not whether they are getting their paycheck on time.
es: En esta etapa, a menudo tiene sentido externalizar muchas funciones de recursos humanos. Hay muchas compañías y plataformas de software disponibles para ayudarlo a administrar la mayoría de las tareas mencionadas anteriormente. Pero muy pocos le brindarán el servicio personalizado y la presencia en persona que ofrecen los servicios de Smart HR; Además, su enfoque debe estar en el crecimiento y la gestión de su equipo, no si están recibiendo su sueldo a tiempo.

source: Companies at this stage often consider hiring a part time Human Resources consultant, that can offer a very customized approach to cover your needs and take over many aspects of payroll, benefits enrollment, recruiting, employment-related compliance, among others; and who can answer many questions that come up around managing your team and legal compliance.
es: Las empresas en esta etapa a menudo consideran contratar a un consultor de Recursos Humanos a tiempo parcial, que puede ofrecer un enfoque muy personalizado para cubrir sus necesidades y hacerse cargo de muchos aspectos de la nómina, la inscripción de beneficios, el reclutamiento, el cumplimiento relacionado con el empleo,entre otros; y quién puede responder muchas preguntas que surjan sobre la administración de su equipo y el cumplimiento legal.

source: 10-40 Employees
es: 10-40 Empleados

source: Your business is humming along and growing every day. At this stage, staying compliant becomes more of a concern and creating/maintaining the right company culture, moral and values can be of utmost importance!
es: Su negocio está zumbando y creciendo cada día. En esta etapa, cumplir con los requisitos se convierte en una preocupación, crear y mantener la cultura, la moral y los valores correctos de la compañía pueden ser de suma importancia.

source: Companies of this size might not big enough to have an HR manager, but they are big enough to know that Human Resources help is needed! And if you are considering whether companies as Smart HR Services is a good investment.
es: Las empresas de este tamaño pueden no ser lo suficientemente grandes como para tener un gerente de recursos humanos, pero son lo suficientemente grandes como para saber que se necesita ayuda de Recursos Humanos. Y si está considerando si las empresas como Smart HR Services son una buena inversión.

source: HR Outsourcing helps small companies that are in need of a Human Resources Professional on a part time basis relieving the overwhelmed owner or office manager of the daily tasks surrounding recruitment, HR, benefits or payroll.
es: La externalización de recursos humanos ayuda a las pequeñas empresas que necesitan un profesional de recursos humanos a tiempo parcial, aliviando al abrumado propietario o gerente de la oficina de las tareas diarias relacionadas con el reclutamiento, los recursos humanos, los beneficios o la nómina. Smart HR Consulting trabaja con profesionales de gestión o recursos humanos en una variedad de formas diferentes. Trabajaremos con usted para desarrollar un modelo de outsourcing que tenga sentido para su negocio y su papel en su empresa, adoptando un enfoque bilingüe cuando sea necesario, para satisfacer también las necesidades de sus empleados.

source: Smart HR Consulting works with management or HR professionals in a variety of different ways. We will work with you to develop an outsourcing model that makes sense for your business and your role in your company taking a bilingual approach when necessary, to meet your employees needs as well.
es: La externalización de recursos humanos ayuda a las pequeñas empresas que necesitan un profesional de recursos humanos a tiempo parcial, aliviando al abrumado propietario o gerente de la oficina de las tareas diarias relacionadas con el reclutamiento, los recursos humanos, los beneficios o la nómina. Smart HR Consulting trabaja con profesionales de gestión o recursos humanos en una variedad de formas diferentes. Trabajaremos con usted para desarrollar un modelo de outsourcing que tenga sentido para su negocio y su papel en su empresa, adoptando un enfoque bilingüe cuando sea necesario, para satisfacer también las necesidades de sus empleados.

source: HR Outsourcing helps small companies that are in need of a Human Resources Professional on a part time basis relieving the overwhelmed owner or office manager of the daily tasks surrounding recruitment, HR, benefits or payroll. Smart HR Consulting works with management or HR professionals in a variety of different ways. We will work with you to develop an outsourcing model that makes sense for your business and your role in your company taking a bilingual approach when necessary, to meet your employees needs as well.
es: La externalización de recursos humanos ayuda a las pequeñas empresas que necesitan un profesional de recursos humanos a tiempo parcial, aliviando al abrumado propietario o gerente de la oficina de las tareas diarias relacionadas con el reclutamiento, los recursos humanos, los beneficios o la nómina. Smart HR Consulting trabaja con profesionales de gestión o recursos humanos en una variedad de formas diferentes. Trabajaremos con usted para desarrollar un modelo de outsourcing que tenga sentido para su negocio y su papel en su empresa, adoptando un enfoque bilingüe cuando sea necesario, para satisfacer también las necesidades de sus empleados.

source: We offer you, your own dedicated on site Hr Manager for a fraction of the cost!
es: ¡Le ofrecemos su propio Administrador de recursos humanos en su empresa por una fracción del costo!

source: Whether you're in need of a short, mid, or long-term solution, we provide a bilingual customized and flexible HR solutions to suit your HR needs. We work on or off-site, either as a standalone HR services consultant or in conjunction with your existing human resources team.
es: Ya sea que necesite una solución a corto, mediano o largo plazo, ofrecemos soluciones de recursos humanos personalizadas y flexibles para satisfacer sus necesidades de Recursos Humanos. Trabajamos dentro o fuera del sitio, ya sea como consultor independiente de servicios de recursos humanos o en conjunto con su equipo de recursos humanos existente.

source: Staffing & Recruiting
es: Dotación de Personal y Reclutamiento

source: Many organizations lack the resources needed to effectively recruit and hire qualified professionals. Consider an on-demand solution.
es: Muchas organizaciones carecen de los recursos necesarios para reclutar y contratar de manera efectiva a profesionales calificados. Considere una solución a pedido.

source: Temporary Recruitment Solutions
es: Soluciones de Reclutamiento Temporal

source: Contract Recruitment
es: Reclutadores por Contrato

source: Job Postings, Screening & Evaluation
es: Ofertas de Trabajo, Proyección y Evaluación

source: Employee Value Proposition (EVP), Employment Branding, Candidate Experience, Social Media Strategy
es: Propuesta de Valor del Empleado (EVP), Marca de Empleo, Experiencia del Candidato, Estrategia de Redes Sociales

source: Applicant Tracking Systems (ATS) – Recommendations, Optimization, Implementation
es: Sistemas de Seguimiento de Candidatos (ATS): Recomendaciones, Optimización, Implementación

source: Background Checks – References, Criminal, Credit, Education
es: Verificaciones de Antecedentes: Referencias, Penal, de Crédito, Educación

source: Psychometric Testing, Competency Modelling
es: Pruebas Psicométricas, Modelado de Competencias

source: HR General Consulting
es: Auditoría y cumplimiento general de recursos humanos

source: Our experienced HR consultants can help you create an employee manual, handle layoffs, or assist with organizational development.
es: Pruebas psicométricas Nuestros consultores de RR. HH. Experimentados pueden ayudarlo a crear un manual para empleados, manejar despidos o ayudar con el desarrollo organizacional.

source: Company Handbook development
es: Desarrollo del Manual de la Empresa

source: Performance Management
es: Gestión del Rendimiento

source: HRIS (Human Resources Information Systems)selection and implementation
es: Selección e implementación de sistemas de información de recursos humanos (HRIS)

source: Contingent Workforce Management
es: Gestión Contingente de la Fuerza Laboral

source: HR Project Management
es: Gestión de Proyectos de Recursos Humanos

source: Policy and Procedure Development
es: Desarrollo de Políticas y Procedimientos

source: General HR Counsel
es: Consejero General de Recursos Humanos

source: Payroll Precessing & Benefits Management
es: Procesamiento de Nómina y Gestión de Beneficios
