Repository: Minesto23/smartHR
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: Your HR department may not be qualified to handle certain HR-related tasks. We can supply qualified specialists on an as-needed basis.
es: Es posible que su departamento de recursos humanos no esté calificado para manejar ciertas tareas relacionadas con recursos humanos.Podemos suministrar especialistas calificados según sea necesario.

source: Compensation and market analysis
es: Compensación y análisis de mercado.

source: Open Enrollment
es: Inscripción Abierta

source: Processing payroll
es: Procesamiento de Nómina

source: Benefits Administration and Selection
es: Administración y Selección de Beneficios

source: HR Audit
es: Auditoría de Recursos Humanos

source: Health & Safety
es: Salud y Seguridad

source: Legal Compliance
es: Cómplice Legal

source: Employee Relations
es: Relaciones Laborales

source: Conflict resolution
es: La resolución de conflictos

source: Downsizing
es: Reducción de personal

source: Rewards
es: Recompensas

source: Culture analysis and review
es: Análisis y Revisión de Cultura.

source: Workplace Investigations
es: Investigaciones Laborales

source: Whether you're in need of a short, mid, or long-term solution, we provide customized and flexible HR solutions to suit your Human Resources needs. We work on or off-site, either as a standalone HR services consultant or in conjunction with your existing human resources team. Current economic trends are now forcing businesses to consider process outsourcing of administrative functions to improve basic services and maintain compliance with the ever changing regulations. Outsourcing daily HR functions, recruitment processes, employee benefit administration and payroll allows key employees to focus on strategic initiatives that benefit the organization, increase productivity and thereby profitability.
es: Ya sea que necesite una solución a corto, mediano o largo plazo, ofrecemos soluciones de recursos humanos personalizadas y flexibles para satisfacer sus necesidades de Recursos Humanos. Trabajamos dentro o fuera del sitio, ya sea como consultor independiente de servicios de recursos humanos o en conjunto con su equipo de recursos humanos existente. Las tendencias económicas actuales están obligando a las empresas a considerar la externalización de procesos de las funciones administrativas para mejorar los servicios básicos y mantener el cumplimiento de las normativas en constante cambio. La externalización de las funciones diarias de recursos humanos, los procesos de reclutamiento, la administración de beneficios de los empleados y la nómina permite a los empleados clave centrarse en iniciativas estratégicas que benefician a la organización, aumentar la productividad y, por lo tanto, la rentabilidad.

source: Bilingual HR Consulting for Small Businesses
es: Consultoría Bilingüe de Recursos Humanos para Pequeñas Empresas

source: Smart HR of South Florida gives you a dedicated HR manager who can help you craft a new HR policy, maintain compliance, onboard new employees or process your payroll- You decide what services you need and how often do you require our support.
es: Smart HR of South Florida le brinda un administrador de recursos humanos dedicado que puede ayudarlo a elaborar una nueva política de recursos humanos, mantener el cumplimiento, incorporar nuevos empleados o procesar su nómina: usted decide qué servicios necesita y con qué frecuencia necesita nuestro apoyo.

source: Your Own Dedicated Bilingual HR Manager
es: Su Propio Gerente de Recursos Humanos Bilingüe Dedicado

source: HR Policy & Procedures
es: Política y Procedimientos de recursos humanos

source: We’ll work with you to craft your internal HR policies that fit the way you run your business.
es: Trabajaremos con usted para elaborar sus políticas internas de recursos humanos que se ajusten a la forma en que maneja su negocio.

source: Payroll Processing Services & Benefits Management
es: Servicios de Procesamiento de Nómina y Gestión de Beneficios

source: Your HR department may not be qualified to handle certain payroll and benefits related tasks. We can supply qualified specialists on an as-needed basis
es: Es posible que su departamento de recursos humanos no esté calificado para manejar ciertas tareas relacionadas con la nómina y los beneficios. Podemos suministrar especialistas calificados según sea necesario

source: Employer Coaching & Guidance
es: Entrenamiento y Guia del empleador

source: Full remote or onsite HR support, available to help by phone, email, or in person. Consider us an extension of your team.
es: Soporte de recursos humanos remoto o en el sitio, disponible para ayudar por teléfono, correo electrónico o en persona. Considéranos una extensión de tu equipo.

source: Compliant Onboarding & Terminations
es: Incorporación y Terminaciones Compatibles

source: We will guide and train your management team to successfully onboard, terminate, and take corrective action with your employees to set them up for success
es: Guiaremos y capacitaremos a su equipo de gestión para que se incorpore, termine y tome medidas correctivas con sus empleados con éxito para prepararlos para el éxito

source: General & Compensation Compliance
es: Cumplimiento General y de Compensación

source: Smart HR makes sure your business stays compliant with nuanced wage and hour regulations.
es: Smart HR se asegura de que su empresa cumpla con las regulaciones matizadas de salarios y horas.

source: Staffing and Recruiting
es: Dotación de Personal y Reclutamiento

source: Many organizations lack the resources needed to effectively recruit and hire qualified professionals.
es: Muchas organizaciones carecen de los recursos necesarios para reclutar y contratar de manera efectiva a profesionales calificados.

source: Happy employees directly translate to amazing customer services; let your employees be your best advertisement.
es: Los empleados felices se traducen directamente en increíbles servicios al cliente; deja que tus empleados sean tu mejor anuncio.

source: General HR Consulting
es: Consultoría General de Recursos Humanos

source: Our experienced HR consultants can help you create an employee manual, handle layoffs, or assist with organizational development
es: Nuestros experimentados consultores de recursos humanos pueden ayudarlo a crear un manual para empleados, manejar despidos o ayudar con el desarrollo organizacional

source: View site
es: Ver Sitio

source: Themes
es: Temas

source: Documentation
es: Documentación

source: Change password
es: Cambiar Cantraseña

source: Log out
es: Cerrar Sesión

source: Cancel
es: Cancelar

source: Clear
es: Limpiar
